In [1]:
import pandas as pd

# Question 1

In [2]:
data = {
    'name':['Andy', 'Jose', 'Dieu', 'Chloe', 'Jose',],
    'continent':['America', 'Europe', 'Asia', 'America', 'Europe'],
    'college':['Lib Arts', 'Business', 'Engineering', 'Engineering', 'Business']
}
STUDENTS = pd.DataFrame(data)

In [3]:
STUDENTS

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering
4   Jose    Europe     Business

A) Write R or Pandas code to de-dup STUDENTS (1pt)

In [4]:
STUDENTS = STUDENTS.drop_duplicates()

In [5]:
STUDENTS

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering

B) Create a data frame COUNTS storing the count of students for each continent, college pair (2pts)

In [6]:
COUNTS = STUDENTS.groupby(['continent','college']).count()

In [7]:
COUNTS

                       name
continent college
America   Engineering     1
          Lib Arts        1
Asia      Engineering     1
Europe    Business        1

C) Pivot COUNTS so that continent values become column names (2pts)

In [8]:
COUNTS = pd.pivot(COUNTS.reset_index(), index=['college'], columns=['continent'], values=['name'])
COUNTS

               name
continent   America Asia Europe
college
Business        NaN  NaN    1.0
Engineering     1.0  1.0    NaN
Lib Arts        1.0  NaN    NaN

D) If applicable, remove any unnecessary index levels created in part C (1pts)

In [9]:
COUNTS.columns = ['America', 'Asia', 'Europe']
COUNTS

             America  Asia  Europe
college
Business         NaN   NaN     1.0
Engineering      1.0   1.0     NaN
Lib Arts         1.0   NaN     NaN

E) Zero-fill missing values in COUNTS (1pt)

In [10]:
COUNTS = COUNTS.fillna(0)
COUNTS

             America  Asia  Europe
college
Business         0.0   0.0     1.0
Engineering      1.0   1.0     0.0
Lib Arts         1.0   0.0     0.0

F) Sort COUNTS reverse alphabetically by college name (1pt)

In [11]:
COUNTS = COUNTS.sort_index(ascending=False)
COUNTS

             America  Asia  Europe
college
Lib Arts         1.0   0.0     0.0
Engineering      1.0   1.0     0.0
Business         0.0   0.0     1.0

# Question 2

## A)	Select the answer to complete the assigned task (2pts)

In [12]:
data = {
    'eggs':[47, 110, 221, 77, 132, 205],
    'salt':[12.0, 50.0, 89.0, 87.0, 0.0, 60.0],
    'spam':[17, 31, 72, 20, 52, 55]
}
df = pd.DataFrame(data, index=['jan', 'feb', 'mar', 'apr', 'may', 'jun'])
df.index.name = 'month'

In [13]:
df

       eggs  salt  spam
month
jan      47  12.0    17
feb     110  50.0    31
mar     221  89.0    72
apr      77  87.0    20
may     132   0.0    52
jun     205  60.0    55

Of the months April, May, and June, calculate how many had eggs>100  
Answer: A

In [14]:
(df.loc[['apr','may','jun'],]['eggs']>100).count()

3

## B) Complete the script to produce the output shown (2pts)  
Output  
datetime.date(2018, 1, 1)  

Script  
import datetime  
datetime.datetime.\______\('01012018', "%d%m%Y")\_______\

Answer: A

In [16]:
import datetime
datetime.datetime.strptime('01012018', "%d%m%Y").date()

datetime.date(2018, 1, 1)

## C) Select the correct script to accomplish the task (2pts)

How would you create a new object with:  
- only the 'setosa' species
- Petal.Width greater than 2
- Sorted by Sepal.Length in descending order

Answer:  
B)	iris.loc[(iris[‘Species’] == ‘setosa’) & (iris[‘Petal.Width’] > 2)].sort_values(‘Sepal.Length’, ascending = False)